title: TestPalo
id: 2592fa08-be11-438c-a42c-a4cfcfaf9c61
status: stable
description: |
  Before deploying any new asset, change all default passwords to have values consistent with administrative level accounts.
references:
    - https://www.cisecurity.org/controls/cis-controls-list/
    - https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
author: Alexandr Yampolskyi, SOC Prime
date: 2019/03/26
logsource:
    product: qualys
detection:
    selection:
        Image:
            - 103434693
            - 11343507
            - 11343633
            - 113434804
    condition: selection
falsepositives:
    - Unknown
level: medium
