title: test25
id: 79729470-2a9c-431f-8f6b-cfd6106f50b0
status: stable
description: |
  Before deploying any new asset, change all default passwords to have values consistent with administrative level accounts.
  Sigma detects default credentials usage. Sigma for Qualys vulnerability scanner. Scan type - Vulnerability Management.
references:
    - https://www.cisecurity.org/controls/cis-controls-list/
    - https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
    - https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
    - https://community.qualys.com/docs/DOC-6406-reporting-toolbox-focused-search-lists
author: Alexandr Yampolskyi, SOC Prime
date: 2019/03/26
logsource:
    product: qualys
detection:
    selection:
        host.scan.vuln:
            - 103434693
            - 11343507
            - 11343633
            - 113434804
    condition: selection
falsepositives:
    - Unknown
level: medium
