title: SigmCheckOneMoreTime
id: 900ba40f-c722-4b16-8cb4-a7af4ce75652
status: experimental
description: Sigma for test parsing tags updated 2 be a sign of forbidden exfiltration
  of data exfiltration by malicious actors
references:
- https://twitter.com/hakluke/status/1587733971814977537/photo/2
- https://ngrok.com/docs/secure-tunnels/tunnels/ssh-reverse-tunnel-block
- https://github.com/WiIs0n/Zerologon_CVE-2020-1472
author: Ján Trenčanský, Çağlayan Meydanı, 漢語水平考試
date: 2022/11/03
tags:
- attack.t1102
- cve.2022.2001.23
logsource:
  product: linux
  category: network_connection
detection:
  selection:
    DestinationHostname|contains:
    - new_test_super_puper_test
    - test1-2-1
  condition: selection
falsepositives:
- Legitimate use of ngrok
level: high
