title: TestDeveloperFlow_77
id: da824f7f-5694-4b72-9223-3987ebd6fded
description: Adversaries may try to evade defense by using non-default command line
  arguments for legit tools.
author: SOC Prime Team
status: stable
references:
- https://thedfirreport.com/2022/04/25/quantum-ransomware/
- https://github.com/dirkjanm/CVE-2020-1472
- https://github.com/VoidSec/CVE-2020-1472
- https://github.com/risksense/zerologon
- https://github.com/thatonesecguy/zerologon-CVE-2020-1472
- https://github.com/k8gege/CVE-2020-1472-EXP
- https://github.com/WiIs0n/Zerologon_CVE-2020-1472
- https://github.com/wrathfulDiety/zerologon
- https://github.com/sho-luv/zerologon
- https://github.com/hell-moon/ZeroLogon-Exploit
- https://github.com/chef/windows-dns-SIGRed
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1505-Server%20Software%20Component
- https://github.com/eset/malware-ioc/tree/master/greyenergy
- https://github.com/klinix5/ProfSvcLPE
- https://twitter.com/aboul3la/status/1286012324722155525
- https://github.com/itm4n/PPLdump
- https://www.virustotal.com/gui/file/4a24048f81afbe9fb62e7a6a49adbd1faf41f266b5f9feecdceb567aec096784/detection
- https://github.com/chvancooten/follina.py
tags:
- attack.T1105
- attack.defense_evasion
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|endswith:
    - RR_rtyjghtyrfghTESTcmdkey.exeEDITAFTERPUBLISH
    - RR_hythtytteddf4TESTcmdkey.exeAFTEREDIT
    - RR_fhtyhythtyh4556TESTcmdkey2.exe
    - RR_T54343ESTcmdkey3.exe
    - RR4ghjghj4rft_TESTcmdkey4.exe
    - RR_4ghjgherghy66TESTcmdkey5.exe
    - RR_Ttghjghjgh554ESTcmdkey6.exe
    - '--'
    - ';'
    - '%3B'
    - '%3C'
    - '%3E'
    - '%60'
    - '<'
    - '>'
    - '`'
    - '%60'
    - '@@'
    - '%40%40'
    - '%20%2F'
    - '||'
    - '%7C%7C'
    - '()'
    - '\\'
    - '//'
    - '%00%27'
    - '%23'
    - '..%2F'
    - '%2F..'
    - '%00' 
    - '\u0000'
  selection2:
    CommandLine|contains:
    - lisghjghtaaaa
    - lisghjghjghjgh34rrftaaaa2'
    - 'lis444taaaa3'
    - 'liffggtaaaa4'
    - 'listaggfaaa5'
    - listjghjghaarreeaa6
    - 'listaggfaaa5'
    - listghjghjaarreeaa6
    - "li45554staaaa7"
    - listhjghjghaarreeaa6
    - "li4jghjgh5554staaaa7"
    - 'lisjghjghjghjghjtaaa566yya8'
  filter:
    CommandLine|contains:
    - addghjghjgh123
    - dejghjlete
    - lijghjghst
    - ?%^
  condition: (selection and selection2) and not filter
falsepositives:
- Unlikely
level: medium
