title: ForbidenAuthor
status: stable
date: 2019/04/17
description: Adversaries may abuse the Windows command shell for execution.
references:
    - https://tdm.socprime.com/
    - https://attack.mitre.org/techniques/T1059/003/
tags:
    - attack.execution
    - attack.t1059.003
author: OSCD_Community
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - 'qwertasd34567fgzxcvb'
    condition: selection
falsepositives:
    - Administrative activity.
level: medium
id: b69a6dbb-8fb9-474c-85f2-1e05fa461046
