title: CheckCortex3
status: stable
date: 2019/04/17
description: Adversaries may abuse the Windows command shell for execution.
references:
    - https://tdm.socprime.com/
    - https://attack.mitre.org/techniques/T1059/003/
tags:
    - attack.execution
    - attack.t1059.003
author: SOC Prime Team
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - 'qwertasd34567fgzxcvb'
    condition: selection
falsepositives:
    - Administrative activity.
level: medium
id: 39eda303-cfb5-431f-a9ca-6abefd62d4d6
