title: ScreenConnectQuotes
id: 6efbbb55-49a4-4193-9cf5-4f8d9cc5e6ab
related:
- id: cdb7ca5c-0157-4e89-a4dc-54c6b3992cb0
  type: similar
status: experimental
description: 'This detects file modifications to the temporary xml user database file
  indicating local user modification in the ScreenConnect server.

  This will occur during exploitation of the ScreenConnect Authentication Bypass vulnerability
  (CVE-2024-1709) in versions <23.9.8, but may also be observed when making legitimate
  modifications to local users or permissions.

  This requires an Advanced Auditing policy to log a successful Windows Event ID 4663
  events and with a SACL set on the directory.

  '
references:
- https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
- https://www.cve.org/CVERecord?id=CVE-2024-1709
- https://www.huntress.com/blog/a-catastrophe-for-control-understanding-the-screenconnect-authentication-bypass
author: Matt Anderson, Kris Luzadre, Andrew Schwartz, Huntress
date: 2024/02/20
tags:
- attack.defense_evasion
- cve.2024.1709
logsource:
  product: windows
  service: security
  definition: 'Requirements: SACLs must be enabled for the ScreenConnect directory'
detection:
  selection:
    EventID: 4663
    ObjectType: File
    AccessMask: '0x6'
    ObjectName|endswith: .xml
    ObjectName|contains|all:
    - Temp
    - ScreenConnect
    ProcessName|contains: ScreenConnect.Service.exe
  condition: selection
falsepositives:
- This will occur legitimately as well and will result in some benign activity.
level: medium
