title: Test546
id: f0322327-6893-4d90-83bd-2ec4e497d2f0
status: test
description: Detects attempts to record audio with arecord utility
references:
    - https://linux.die.net/man/1/arecord
    - https://linuxconfig.org/how-to-test-microphone-with-audio-linux-sound-architecture-alsa
author: 'Pawel Mazur'
date: 2021/09/04
modified: 2022/10/09
tags:
    - attack.collection
    - attack.t1123
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: EXECVE
        a0: arecord
        a1: '-vv'
        a2: '-fdat'
    condition: selection
falsepositives:
    - Unknown
level: low
